_posts/2016-06-23-LIRS-要点.html
---
layout : post
title : LIRS 要点
categories : Algorithm
tags : algorithm lirs cache
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf22bd45">Recency &amp; Inter-reference Recency</a>
<ul>
<li><a href="#orgf18a2b5">Recency</a></li>
<li><a href="#org99b0b78">IRR: Inter-Reference Recency</a></li>
</ul>
</li>
<li><a href="#orga870bbe">冷页与热页</a></li>
<li><a href="#org1fddb50">Stack &amp; Queue</a>
<ul>
<li><a href="#org403d89f">Stack</a></li>
<li><a href="#org8fc4afa">Queue</a></li>
</ul>
</li>
<li><a href="#org74d00c4">页替换规则</a>
<ul>
<li><a href="#org6fb7028">热页</a></li>
<li><a href="#org1e49379">驻留冷页</a></li>
<li><a href="#org49d934a">如果该页之前已经在栈里</a></li>
<li><a href="#org0a022ec">如果该页之前仅在队里（之前为冷页）</a></li>
<li><a href="#org0a6a950">非驻留冷页</a></li>
<li><a href="#orgbca7a83">如果该页之前仅在队里（之前为冷页）</a></li>
</ul>
</li>
<li><a href="#org7843193">页的状态</a></li>
</ul>
</div>
</div>
<p>
简单记录一下 <b>LIRS</b> 相关要点。
</p>


<div id="outline-container-orgf22bd45" class="outline-2">
<h2 id="orgf22bd45">Recency &amp; Inter-reference Recency</h2>
<div class="outline-text-2" id="text-orgf22bd45">
<p>
LIRS*: Low Inter-reference Recency Set，中文？？
</p>
</div>

<div id="outline-container-orgf18a2b5" class="outline-3">
<h3 id="orgf18a2b5">Recency</h3>
<div class="outline-text-3" id="text-orgf18a2b5">
<p>
页面上次访问至今，共访问了多少其他页面。
</p>
</div>
</div>

<div id="outline-container-org99b0b78" class="outline-3">
<h3 id="org99b0b78">IRR: Inter-Reference Recency</h3>
<div class="outline-text-3" id="text-org99b0b78">
<p>
页最近两次访问之间访问了多少次其他页面。 IRR 越大 (high)，表示该页被使用的间隔越长，频率越低，越 “冷”。反之， IRR 越小 (low)， 该页使用间隔越小，频率越高，即越 “热”。
</p>
</div>
</div>
</div>


<div id="outline-container-orga870bbe" class="outline-2">
<h2 id="orga870bbe">冷页与热页</h2>
<div class="outline-text-2" id="text-orga870bbe">
<p>
面根据 IRR 分为了两类： LIR (low IRR) 与 HIR (high IRR) ，也即：热页与冷页。中，热页驻留内存，而冷页则不一定驻留。
</p>

<p>
页的数量略小于 Cache 中能缓存的页面总数大小，再热页限制到达之前，所有页面都是热页。而当热限制到达之后， <b>LIRS</b> 根据<a href="#org74d00c4">算法</a> 来进行后续处理。
</p>
</div>
</div>

<div id="outline-container-org1fddb50" class="outline-2">
<h2 id="org1fddb50">Stack &amp; Queue</h2>
<div class="outline-text-2" id="text-org1fddb50">
<p>
LIRS* 算法中借用了两个数据结构来实现： Stack &amp; Queue
</p>
</div>

<div id="outline-container-org403d89f" class="outline-3">
<h3 id="org403d89f">Stack</h3>
<div class="outline-text-3" id="text-org403d89f">
<p>
tack (栈) 是 LIRS  算法中的主要数据结构，其中存储了所有的热页以及最近使用的冷页。
tack 本身依据 Recency 排序：越老的越靠近栈底，越新的越靠近栈顶。栈里面比 least recent hot page 还的页会从栈中移除 (stack pruning)，因此栈底的页始终是热页。
</p>

<p>
tack 中的冷页其实是住在一个 “试用期”，如果期间冷页被再次引用，则转为热页，否则将最终被栈底移除。
</p>
</div>
</div>

<div id="outline-container-org8fc4afa" class="outline-3">
<h3 id="org8fc4afa">Queue</h3>
<div class="outline-text-3" id="text-org8fc4afa">
<p>
Queue (队) 中保存了所有驻留内存的冷页。当热页从 Stack 中移除时，该页被加入到 Queue
末尾。而当需要进行页面替代时， <b>LIRS</b> 会从 Queue 的首部取出一个页面以供使用。
</p>
</div>
</div>
</div>

<div id="outline-container-org74d00c4" class="outline-2">
<h2 id="org74d00c4">页替换规则</h2>
<div class="outline-text-2" id="text-org74d00c4">
<p>
向 <b>LIRS List</b> 中插入页时，会根据待插入的页类型来进行处理：
</p>
</div>

<div id="outline-container-org6fb7028" class="outline-3">
<h3 id="org6fb7028">热页</h3>
<div class="outline-text-3" id="text-org6fb7028">
<p>
果待插入页为热页，将该页置于栈顶，而如果该页之前处于栈底，则需对栈进行<a href="#org403d89f">清理</a>
</p>
</div>
</div>

<div id="outline-container-org1e49379" class="outline-3">
<h3 id="org1e49379">驻留冷页</h3>
<div class="outline-text-3" id="text-org1e49379">
<p>
先将该页置于栈顶，并做如下处理：
</p>
</div>
</div>

<div id="outline-container-org49d934a" class="outline-3">
<h3 id="org49d934a">如果该页之前已经在栈里</h3>
<div class="outline-text-3" id="text-org49d934a">
<ol class="org-ol">
<li>则将其转换为热页，并从队中移除。</li>
<li>将栈底标记为冷页，并移到队尾。</li>
<li>对栈进行<a href="#org403d89f">清理</a> 。</li>
</ol>
</div>
</div>

<div id="outline-container-org0a022ec" class="outline-3">
<h3 id="org0a022ec">如果该页之前仅在队里（之前为冷页）</h3>
<div class="outline-text-3" id="text-org0a022ec">
<p>
不改变冷热状态，但挪动队尾。
</p>
</div>
</div>

<div id="outline-container-org0a6a950" class="outline-3">
<h3 id="org0a6a950">非驻留冷页</h3>
<div class="outline-text-3" id="text-org0a6a950">
<p>
队首移除一条记录，并将其从 Cache 中驱逐。如果被驱逐的记录之前已经在栈里，则其仍处于未绑定，依然处于试用期。将这个记录与 cache 页绑定，并移植栈顶：果该页之前已经在栈里：<br />
</p>
<ol class="org-ol">
<li>则将其转换为热页，并从队中移除。</li>
<li>将栈底标记为冷页，并移到队尾。</li>
<li>对栈进行<a href="#org403d89f">清理</a> 。</li>
</ol>
</div>
</div>

<div id="outline-container-orgbca7a83" class="outline-3">
<h3 id="orgbca7a83">如果该页之前仅在队里（之前为冷页）</h3>
<div class="outline-text-3" id="text-orgbca7a83">
<p>
不改变冷热状态，但挪动队尾。
</p>
</div>
</div>
</div>

<div id="outline-container-org7843193" class="outline-2">
<h2 id="org7843193">页的状态</h2>
<div class="outline-text-2" id="text-org7843193">
<p>
栈里面的页可以是绑定的，页可以是非绑定的，但队里面的页必须是绑定状态的。
</p>
</div>
</div>
